{"results":[{"command":{"func":"getData","kwargs":[{"range":"'All Tools'!A:L","hasHeaderRow":true},null]},"result":{"rawData":[["","","2021-01-15","","https://github.com/gyf304/vmcli","","","","","","",""],["Lambda Test","LT Browser","2021-01-13","","https://www.lambdatest.com/lt-browser","2021-01-13","Developer Tools","N/A","A browser for testing mobile and responsive websites.","Supports 45 devices out of the box plus ability to create custom sizes. Hot reload. Built-in devtools for live debugging. Lighthouse reports. Test on two devices side-by-side. Cross-platform support, including Linux.","This is built into Chrome and other browsers, so why do we need another tool?","@Lambdatesting"],["Vantage","Vantage","2021-01-13","2021-01-14","https://www.vantage.sh/","2021-01-12","Cloud","SaaS","AWS Console designed for developers.","AWS Console UX is not great; Vantage is much cleaner and faster. It connects using a read-only CloudFormation IAM Role and they have detailed documentation about the read-only permissions it requests. \"Views\" nicely segment/group resources, even across accounts and regions, with global search for them all. Cost reporting by view and weekly email reports help you manage budgets better.","Does not support all AWS products, currently focused on a few key resources e.g. EC2 instances, VPC Subnets, Route53, etc. Currently read-only, which is good for security and because it's a new tool - plans to add more management features in the future. Also AWS-only, but they are working on other cloud providers.","@JoinVantage"],["Nushell","Nushell","2021-01-13","","https://www.nushell.sh","2019-08-23","Developer Tools","Open Source","A shell where everything is data.","The first thing you notice is running `ls` outputs a structured table. All output is actually data, so it is like interacting with a spreadsheet. Nushell applies the Unix philosophy of piping commands but allows for commands like `ls | where size > 1kb`. Supports parsing data like CSV and JSON. Cross platform.","Although it can be run as a command, it is designed to replace your existing shell. It is still in development so may not be stable. You will have to reconfigure everything if you have heavily customized your shell.","@nu_shell"],["Skynet","Skynet","2021-01-13","2021-01-14","https://siasky.net/","","API","Open Source","Decentralized file storage and CDN.","Web UI and SDKs for uploading files to a decentralized CDN. Uses a blockchain and rewards users who run nodes with coins which can be exchanged for money. Current average cost = $4.16/TB stored + $1.25/TB transferred.","Time to first byte 300-500ms may be prohibitatively slow for some use cases. Streaming \"up to 1Gbps\" but what does \"up to\" really mean? Files must be public. Why call it \"Skynet\"?!","@siatechhq"],["James Little","Stork Search","2021-01-13","2021-01-14","https://stork-search.net/","2020-12-13","Developer Tools","Open Source","Fast search for static sites.","Generate the index of your content, which is then downloaded by the visitor's browser and searched using the JS/WASM library \"locally\" - this is what makes it so fast.","Index must be generated manually. It is specifically designed for static sites, so it would need to be hooked into a build process. Would need extra work if you wanted to index a dynamic site.","@jameslittle230"],["Convier","Convier","2021-01-13","","https://convier.me/","2021-01-09","API","SaaS","A REST API to exchange calendaring and scheduling information in iCalendar format.","Figuring out the iCalendar format is a pain so this API abstracts the RFCs into a simple REST API.","Doesn't follow standards for defining times, dates, and timezones, which makes it difficult to properly handle timezones. They are supported but are not mandatory. Docs are somewhat inconsistent on this.","@MikaelCarlavan"],["ViaSocket","Hitman","2021-01-06","","http://hitman.app/","","API","SaaS","Browser code editor for designing APIs, then generate the docs.","Makes it easy to create well-designed APIs and build out high-quality documentation at the same time.","Hosted service with no paid option yet. No way to manage and control the docs on your own systems.","@viasocket"],["","Starship","2021-01-06","2021-01-07","https://starship.rs","","Developer Tools","Open Source","High-performance, customizable, shell prompt.","Works with any shell (bash, zsh, fish, PowerShell). Context-sensitive e.g. auto-complete, shows Git info, lots of language specific configs. Written in Rust, which is trendy, and probably fast.","Another layer on your shell to mess around with. If you use ZSH then Oh My ZSH already does a lot of this, and has lots of good ZSH tweaks.","@StarshipPrompt"],["Project Jupyter","JupyterLab 3.0","2021-01-06","","https://jupyter.org/","2021-01-05","Developer Tools","Open Source","Web based IDE for data science notebooks.","Building scientific models in code is a more open alternative than spreadsheets. Steps can be explaIned in-line, visualised, and options presented for users to change the output in real-time. Written in Python, but supports 40+ languages. Fairly well known in the science community.","Not easy to install. Excel is popular because it is so easy to get going, share, and collaborate. Getting a local Python environment running needs to be done in a virtual environment to avoid global package conflicts.","@ProjectJupyter"],["","Wasmer 1.0","2021-01-06","2021-01-07","https://wasmer.io/","2021-01-05","Developer Tools","Open Source","An open-source runtime for executing WebAssembly server-side.","Allows shared libraries to be sandboxed, compiled, then run standalone or embedded in Rust, C/C++, Python, Go. Pluggable compilers allows optimisation of the final artifacts e.g. LLVM for machine code. Wasmer 1.0 adds a headless mode and cross-compilation.","The use cases seem limited to untrusted, shared code. If you need cross-platform, native binaries with good performance then why not just use a compiled language like Go or Rust in the first place?","@wasmerio"],["","VLang","2020-12-30","2020-12-31","https://vlang.io/","","Developer Tools","Open Source","A Go-like language that is as fast as C and compiles to tiny native binaries.","Very simple language - detailed documentation which makes it easy to learn. Performance is a big feature - claims to be as fast as C. Built-in ORM and web framework. Cross-platform UI library.","Initial 0.1 a year ago was controversial due to lots of claims that weren't backed up, but progress to 0.2 seems to have resolved many of them. Very early-stage language built mainly by 1 person, so few people will know it. Approach to memory management seems experimental.","@v_language"],["","DevUtils.app","2020-12-30","2020-12-31","https://devutils.app/","","Developer Tools","Open Source","Mac app containing useful developer utilities e.g. JSON formatter, query string parser, Unix time converter.","All those little tools you search for online each time you need them, but in a local app so you don't paste your data into random websites. Pay $15 for the compiled version or download the source code for free and compile it yourself. Native macOS (Swift).","Only for macOS.","@devutils_app"],["Koj","Upptime","2020-12-28","2020-12-31","https://upptime.js.org/","","DevOps","Open Source","An open source uptime monitor and status page powered by GitHub actions.","Nicely designed status pages. Monitoring triggered every 5 minutes using GitHub actions - can stay within the free quota. Different notification types supported. Good integration with GitHub issues.","Relies on GitHub. 5 minute check granularity. Is this an abuse of the GitHub Actions service, which isn't designed to run mission-critical monitoring.","@AnandChowdhary"],["","edamagit","2020-12-28","","https://github.com/kahole/edamagit","","Developer Tools","Open Source","Keyboard driven Git interface for VS Code","Text-based and keyboard focused makes managing Git repos really fast inside VS Code.","Missing some features from Magit (which it is based on), such as bisect and patch.",""],["Bytedance","TerarkDB","2020-12-23","","https://github.com/bytedance/terarkdb","2020-12-16","Database","Open Source","RocksDB KV replacement with better performance.","Optimised tail performance, throughput, and compression. Easy migration from RocksDB.","Only C/C++ bindings are fully tested. Can only migrate one way - can't go back to RocksDB. Very limited documentation.",""],["Hotwire","Hotwire","2020-12-23","2020-12-24","https://hotwire.dev/","2020-12-22","Developer Tools","Open Source","HTML over the wire instead of JSON.","Allows web applications to load faster with less client-side processing by rendering HTML server-side. With so much cheap compute in the cloud (or on VMs), why let low-power/battery constrained user devices do all the work? Provides a web framework which can also be used in native iOS and Android apps.","Reference integration available only for Ruby on Rails, but it can be used with other languages. Yet another framework to use. Some logic goes into HTML syntax.",""],["SuperTokens","SuperTokens Core","2020-12-16","","https://github.com/supertokens/supertokens-core","2020-12-15","Developer Tools","Open Source","Open source version of Auth0.","Modular components make it easy to customise, particularly if you want to run your own credential store rather than offload it to a SaaS vendor like Auth0 and AWS Cognito. Optional session management component. SaaS version is optional. Self-hosted is free forever.","Written in Java. Doesn't support yet support user management like password reset. Open source models are hard - business model for the company behind it is yet to be proven.",""],["Crowd Security","CrowdSec","2020-12-16","2020-12-17","https://github.com/crowdsecurity/crowdsec","2020-11-01","DevOps","Open Source","A modern Fail2ban using crowd sourced detection.","Follows local log files to build a profile of normal activity. Can take configurable actions e.g. ban IP, on detecting unusual behaviour. Crowdsources definitions of \"unusual\" without sending any log data to the cloud.","Early release. Open source but built by a startup that is on a route to funding next year.","@Crowd_Security"],["Microlink","Microlink","2020-12-16","2020-12-17","https://microlink.io/","","API","SaaS","Browser as an API","Simulate a browser accessing a URL to retrieve screenshots, metadata (Open Graph, Twitter, JSON+LD, oEmbed & HTML), convert to PDF, track speed using Lighthouse. Open source so you can run it yourself, or pay for hosted cloud version.","There is a CLI but the SDKs seem to be JS based for building things like link previews in the browser. More language bindings would be useful.","@microlinkhq"],["DevBook","DevBook","2020-12-16","","https://usedevbook.com/","2020-12-01","Developer Tools","SaaS","A search engine made just for developers.","Quickly search GitHub and StackOverflow using keyboard shortcuts, like OS X Spotlight or Alfred. Built-in code highlighting.","macOS only.",""],["GitHub","Dark Mode","2020-12-09","2020-12-10","https://github.com/settings/appearance","2020-12-08","Developer Tools","SaaS","Official dark mode for GitHub","Finally! One of the last remaining developer tools that didn't have dark mode. Can set it to force dark, force light, or use system default.","Could use some more contrast, but otherwise we really like this!",""],["Mapbox","GL JS","2020-12-09","2020-12-10","https://www.mapbox.com/mapbox-gljs","2020-12-08","API","N/A","A JS library for vector maps.","Renders detailed maps at 60fps. Adds progressive loading for tiles and cusom design elements. New camera API for precise viewing adjustments and the new Sky API simulates the sun's position based on time of day and location.","Does not support offline usage although tilea are cached for 30 days on client devices. Mapbox is setting the standard for commercial mapping with flexible customisation, but Google still wins in most locations for accuracy and detail. The tradeoff is privacy.",""],["WakaTime","WakaTime","2020-12-09","","https://wakatime.com/","","Developer Tools","SaaS","A service to track personal for metrics about your programming.","See how much time you spend coding, in which languages, and on which projects.","Massive invasion of privacy. Fun if you keep it private for your own use but dangerous if it is used in a business context. Time spent != quality | productivity.",""],["Rahul Padalkar","Beautiful Codes","2020-12-07","","https://www.beautifulcodes.in/","2020-12-03","Developer Tools","SaaS","Code screenshot generator.","Easy generation of code snippets with customisable colours, fonts, and syntax highlighting.","Would like to see different image formats, ideally SVG. Maybe code snippets are better in actual text format?",""],["Microsoft","Ethr","2020-12-03","2020-12-10","https://github.com/microsoft/ethr","2020-11-24","DevOps","Open Source","Cross-platform netrwork performance measurement CLI.","It's comprehensive. Includes measurements of bandwidth, connections/s, packets/s, latency, loss, jitter, multi-protocol support and multi-platform support. Written in Go.","Nothing! This tool just does the job.",""],["CNCF","Kuma 1.0","2020-12-02","2020-12-03","https://github.com/kumahq/kuma","2020-12-01","DevOps","Open Source","Control plane for Service Mesh and Microservices","Makes it easy to build a L4/L7 control plane so you can manage connectivity over (often unreliable) networks. v1.0 adds multi-zone support and out-of-the-box Grafana metrics. Allows you to trace/monitor traffic and manage blue/green, canary, and versioned deploys (+ rollbacks).","YAML config (some people love YAML, some hate it). Another layer to manage in your infrastructure stack.",""],["Load Impact","k6","2020-12-01","2020-12-03","https://k6.io/","","Developer Tools","Open Source","A load testing tool designed for local and CI/CD performance testing.","Easy to get started with comprehensive documentation, CLI invocation, easy config using JS scripts with advanced support for HTTP2, WebSockets, cookies, .har output, and distributed execution via a commercial SaaS product.","Doesn't run a browser (by design) so browser-specific APIs are not available.",""],["mhx","DwarFS","2020-11-30","2020-12-03","https://github.com/mhx/dwarfs","2020-11-22","Developer Tools","Open Source","A high compression read-only file system.","Focus on performance: reported to be faster with less CPU usage than other file systems, and an order of magnitude greater compression than SquashFS. Clusters files by similarity based on a hash function.","Early release - so be careful with your files!",""],["Thought Machine","Please","2020-11-30","","https://please.build/","","Developer Tools","Open Source","A local code build system, like make, written in Go, and designed for multi-language support.","Focus on performance. Native sandboxing. Produces a single executable binary with alll dependencies self-contained e.g. Python creates a .pex file like a .jar file.","Quick start is a bit more involved e.g. 28 min guide for Python, 30 min guide for Go. Uses a DSL for build files so you have to learn something entirely new. Uses non-standard approaches for some languages e.g. Python outputs a single .pex file and dependencies must be defined in the build file, not requirements.txt. Limited support for remote builds and cross compiling.",""],["Autocode","Autocode","2020-11-25","2020-11-26","https://autocode.com/","2020-11-24","Developer Tools","SaaS","Automate and integrate services, backed by code.","Allows you to integrate APIs, webhooks, and services without running your own servers; like Zapier, but backed by code so it is significantly more flexible. Includes an open source framework and has a standard library of integrations with the likes of Airtable, GMail, GCal, GitHub, Slack, Trello. Use their web IDE or use the cli to bring your own local environment.","Based around JS and npm (may bean advantage if you're happy working with JS, like everything seems to be these days!). Relies on a hosted service - you can't manage your own infrastructure (by design), so you lose control of things like reliability and security which may be important for some of the data being sent e.g. Stripe payments.",""],["Lens","Lens","2020-11-25","2020-11-26","https://github.com/lensapp/lens","2020-11-20","DevOps","Open Source","An IDE for managing k8s clusters locally or remote (including EKS, GKE, AKS) on Windows, macOS, or Linux.","Easy to use on any desktop platform by pointing to your kubeconfig file. Provides real time stats, log streams and graphical visualisations via Prometheus. Helm Charts support. Multi-cluster support. Open source.","Powerful for development but it is bad practice to directly connect to production environments.",""],["Clockwork","DevTerm","2020-11-25","2020-11-26","https://www.clockworkpi.com/","2020-11-20","Developer Tools","Open Source","A portable hardware terminal based on a RaspberryPi with built-in keyboard and display.","Small (A5 size), retro design with built-in 5G and lots of ports. Comes disassembled and with a modular design so it's designed to be fun to put together and upgradable. 1280x480 IPS screen. Open source software and hardware.","Flat display means ergonomics may be a pain. Uses a RaspberryPi so max 4GB memory and an ARM chip which may limit software availability (this is rapidly improving, especially with the new Apple M1 chips). Requires 18650 battery (not included). Not shipping until April 2021",""],["AWS","Network Firewall","2020-11-18","2020-11-19","https://aws.amazon.com/blogs/aws/aws-network-firewall-new-managed-firewall-service-in-vpc/","2020-11-17","Cloud","SaaS","VPC level high-availability network firewall that offers stateful inspection and filtering at the virtual network level.","Works at the network level to interact with all associated services. Integrated logging with AWS Kinesis and Cloudwatch as well as third party services like Datadog, Sumologic and Splunk.","Limited to US East (N. Virginia), US West (Oregon), and Europe (Ireland) Regions for now. Potentially expensive per GB traffic processing fees.",""],["EteSync","Etebase","2020-11-17","2020-11-19","https://blog.etesync.com/introducing-etebase-an-end-to-end-encrypted-sdk-and-backend/","2020-11-16","Database","Open Source","End-to-end encrypted Firebase-like database and SDK for applications.","Open source end-to-end encryption based on libsodium. SDKs for Python, JS, Java, and C. We like privacy!","Uncertain funding. Supported by a foundation and the a European Commission program, and this is core component of the EteSync suite, but is it just a side project that will be developed ad-hoc?",""],["strongDM","strongDM","2020-11-17","","https://www.strongdm.com/","2020-11-16","Developer Tools","SaaS","VPN replacement for tunnelling and SSHing into company resources such as servers, databases and internal tools.","Provides a secure way for developers to access resources in production without annoying VPNs, and with history and audit logging for compliance.","Should developers really be accessing these resources directly?",""],["Microsoft","RAFT","2020-11-19","","https://github.com/microsoft/rest-api-fuzz-testing","2020-11-16","Developer Tools","Open Source","REST API fuzzing tool for use in CI/CD.","Run multiple fuzzers in parallel. Can read the Swagger spec to automatically generate tests.","It can run anywhere but is designed to run on Azure.",""],["NSA","Ghidra 9.2","2020-11-17","","https://ghidra-sre.org/","2020-11-13","Developer Tools","Open Source","A set of tools for reverse engineering and anlysing compiled software on Windows, macOS, and Linux.","Designed for analysing malicious code but has functionality that allows you to explore how compile apps work without the source code.","Requires Java. Limited documentation.",""],["rogchap","Wombat","2020-11-19","","https://github.com/rogchap/wombat","2020-11-12","Developer Tools","Open Source","A cross-platform desktop gRPC client that allows for rapid interaction with APIs.","Auto discovery of protocols makes it easy to connect APIs for rapid debugging. Built using Go and a non-Electron web framework wrapper.","Lacks a true native feel due to the use of web tech inside a wrapper.",""],["ogham","dog 0.1","2020-11-17","","https://dns.lookup.dog/","2020-11-07","DevOps","Open Source","A command line interface for querying DNS records. Supports DNS over TLS, DNS over HTTPs, and JSON output.","Very lightweight, written in Rust, cross platform support, colourful output, and generally a much nicer way to query DNS than dig.","No official packages for installing (binaries available for all platforms).",""],["micro","Micro 3.0 (M3O)","2020-11-17","2020-11-19","https://micro.mu/blog/2020/11/05/micro-v3-aka-m3o.html","2020-11-05","Developer Tools","SaaS","An open source framework (micro) that makes it easy to build microservices for cloud environments, especially if you use their paid SaaS platform (M30).","Lightweight framework written in Go and Rust which reminds us of Ruby on Rails. Quick creation of key microservices components such as service discovery, auth and API gateway. Can use free, open source, or pay for their cloud service.","Cloud platform is very early with low resource caps and billed per user rather than on resource usage. Unsure how this sits alongside mature cloud platforms from AWS, GCP or Azure. No production-grade SLAs or monitoring.",""],["Hasura","Hasura GraphQL","2020-11-17","","https://hasura.io/","","Developer Tools","SaaS","A database connector for PostgreSQL and MySQL that allows you to query them using GraphQL.","Easily create a GraphQL API on existing databases, with automatic authentication and caching layers. Available open source and as a cloud service with monitoring, auto-scaling, regression testing and rate limiting.","This is an additional layer between your frontend and the database, they do not host the database itself. The performance overhead is unknown.",""]],"formatted":[{"Company/Org":"","Tool/Product/Project":"","Initial review":"2021-01-15","Scheduled for":"","URL":"https://github.com/gyf304/vmcli","Announced":"","Category":"","Type":"","What is it?":"","What we like":"","What we dislike":"","Twitter":""},{"Company/Org":"Lambda Test","Tool/Product/Project":"LT Browser","Initial review":"2021-01-13","Scheduled for":"","URL":"https://www.lambdatest.com/lt-browser","Announced":"2021-01-13","Category":"Developer Tools","Type":"N/A","What is it?":"A browser for testing mobile and responsive websites.","What we like":"Supports 45 devices out of the box plus ability to create custom sizes. Hot reload. Built-in devtools for live debugging. Lighthouse reports. Test on two devices side-by-side. Cross-platform support, including Linux.","What we dislike":"This is built into Chrome and other browsers, so why do we need another tool?","Twitter":"@Lambdatesting"},{"Company/Org":"Vantage","Tool/Product/Project":"Vantage","Initial review":"2021-01-13","Scheduled for":"2021-01-14","URL":"https://www.vantage.sh/","Announced":"2021-01-12","Category":"Cloud","Type":"SaaS","What is it?":"AWS Console designed for developers.","What we like":"AWS Console UX is not great; Vantage is much cleaner and faster. It connects using a read-only CloudFormation IAM Role and they have detailed documentation about the read-only permissions it requests. \"Views\" nicely segment/group resources, even across accounts and regions, with global search for them all. Cost reporting by view and weekly email reports help you manage budgets better.","What we dislike":"Does not support all AWS products, currently focused on a few key resources e.g. EC2 instances, VPC Subnets, Route53, etc. Currently read-only, which is good for security and because it's a new tool - plans to add more management features in the future. Also AWS-only, but they are working on other cloud providers.","Twitter":"@JoinVantage"},{"Company/Org":"Nushell","Tool/Product/Project":"Nushell","Initial review":"2021-01-13","Scheduled for":"","URL":"https://www.nushell.sh","Announced":"2019-08-23","Category":"Developer Tools","Type":"Open Source","What is it?":"A shell where everything is data.","What we like":"The first thing you notice is running `ls` outputs a structured table. All output is actually data, so it is like interacting with a spreadsheet. Nushell applies the Unix philosophy of piping commands but allows for commands like `ls | where size > 1kb`. Supports parsing data like CSV and JSON. Cross platform.","What we dislike":"Although it can be run as a command, it is designed to replace your existing shell. It is still in development so may not be stable. You will have to reconfigure everything if you have heavily customized your shell.","Twitter":"@nu_shell"},{"Company/Org":"Skynet","Tool/Product/Project":"Skynet","Initial review":"2021-01-13","Scheduled for":"2021-01-14","URL":"https://siasky.net/","Announced":"","Category":"API","Type":"Open Source","What is it?":"Decentralized file storage and CDN.","What we like":"Web UI and SDKs for uploading files to a decentralized CDN. Uses a blockchain and rewards users who run nodes with coins which can be exchanged for money. Current average cost = $4.16/TB stored + $1.25/TB transferred.","What we dislike":"Time to first byte 300-500ms may be prohibitatively slow for some use cases. Streaming \"up to 1Gbps\" but what does \"up to\" really mean? Files must be public. Why call it \"Skynet\"?!","Twitter":"@siatechhq"},{"Company/Org":"James Little","Tool/Product/Project":"Stork Search","Initial review":"2021-01-13","Scheduled for":"2021-01-14","URL":"https://stork-search.net/","Announced":"2020-12-13","Category":"Developer Tools","Type":"Open Source","What is it?":"Fast search for static sites.","What we like":"Generate the index of your content, which is then downloaded by the visitor's browser and searched using the JS/WASM library \"locally\" - this is what makes it so fast.","What we dislike":"Index must be generated manually. It is specifically designed for static sites, so it would need to be hooked into a build process. Would need extra work if you wanted to index a dynamic site.","Twitter":"@jameslittle230"},{"Company/Org":"Convier","Tool/Product/Project":"Convier","Initial review":"2021-01-13","Scheduled for":"","URL":"https://convier.me/","Announced":"2021-01-09","Category":"API","Type":"SaaS","What is it?":"A REST API to exchange calendaring and scheduling information in iCalendar format.","What we like":"Figuring out the iCalendar format is a pain so this API abstracts the RFCs into a simple REST API.","What we dislike":"Doesn't follow standards for defining times, dates, and timezones, which makes it difficult to properly handle timezones. They are supported but are not mandatory. Docs are somewhat inconsistent on this.","Twitter":"@MikaelCarlavan"},{"Company/Org":"ViaSocket","Tool/Product/Project":"Hitman","Initial review":"2021-01-06","Scheduled for":"","URL":"http://hitman.app/","Announced":"","Category":"API","Type":"SaaS","What is it?":"Browser code editor for designing APIs, then generate the docs.","What we like":"Makes it easy to create well-designed APIs and build out high-quality documentation at the same time.","What we dislike":"Hosted service with no paid option yet. No way to manage and control the docs on your own systems.","Twitter":"@viasocket"},{"Company/Org":"","Tool/Product/Project":"Starship","Initial review":"2021-01-06","Scheduled for":"2021-01-07","URL":"https://starship.rs","Announced":"","Category":"Developer Tools","Type":"Open Source","What is it?":"High-performance, customizable, shell prompt.","What we like":"Works with any shell (bash, zsh, fish, PowerShell). Context-sensitive e.g. auto-complete, shows Git info, lots of language specific configs. Written in Rust, which is trendy, and probably fast.","What we dislike":"Another layer on your shell to mess around with. If you use ZSH then Oh My ZSH already does a lot of this, and has lots of good ZSH tweaks.","Twitter":"@StarshipPrompt"},{"Company/Org":"Project Jupyter","Tool/Product/Project":"JupyterLab 3.0","Initial review":"2021-01-06","Scheduled for":"","URL":"https://jupyter.org/","Announced":"2021-01-05","Category":"Developer Tools","Type":"Open Source","What is it?":"Web based IDE for data science notebooks.","What we like":"Building scientific models in code is a more open alternative than spreadsheets. Steps can be explaIned in-line, visualised, and options presented for users to change the output in real-time. Written in Python, but supports 40+ languages. Fairly well known in the science community.","What we dislike":"Not easy to install. Excel is popular because it is so easy to get going, share, and collaborate. Getting a local Python environment running needs to be done in a virtual environment to avoid global package conflicts.","Twitter":"@ProjectJupyter"},{"Company/Org":"","Tool/Product/Project":"Wasmer 1.0","Initial review":"2021-01-06","Scheduled for":"2021-01-07","URL":"https://wasmer.io/","Announced":"2021-01-05","Category":"Developer Tools","Type":"Open Source","What is it?":"An open-source runtime for executing WebAssembly server-side.","What we like":"Allows shared libraries to be sandboxed, compiled, then run standalone or embedded in Rust, C/C++, Python, Go. Pluggable compilers allows optimisation of the final artifacts e.g. LLVM for machine code. Wasmer 1.0 adds a headless mode and cross-compilation.","What we dislike":"The use cases seem limited to untrusted, shared code. If you need cross-platform, native binaries with good performance then why not just use a compiled language like Go or Rust in the first place?","Twitter":"@wasmerio"},{"Company/Org":"","Tool/Product/Project":"VLang","Initial review":"2020-12-30","Scheduled for":"2020-12-31","URL":"https://vlang.io/","Announced":"","Category":"Developer Tools","Type":"Open Source","What is it?":"A Go-like language that is as fast as C and compiles to tiny native binaries.","What we like":"Very simple language - detailed documentation which makes it easy to learn. Performance is a big feature - claims to be as fast as C. Built-in ORM and web framework. Cross-platform UI library.","What we dislike":"Initial 0.1 a year ago was controversial due to lots of claims that weren't backed up, but progress to 0.2 seems to have resolved many of them. Very early-stage language built mainly by 1 person, so few people will know it. Approach to memory management seems experimental.","Twitter":"@v_language"},{"Company/Org":"","Tool/Product/Project":"DevUtils.app","Initial review":"2020-12-30","Scheduled for":"2020-12-31","URL":"https://devutils.app/","Announced":"","Category":"Developer Tools","Type":"Open Source","What is it?":"Mac app containing useful developer utilities e.g. JSON formatter, query string parser, Unix time converter.","What we like":"All those little tools you search for online each time you need them, but in a local app so you don't paste your data into random websites. Pay $15 for the compiled version or download the source code for free and compile it yourself. Native macOS (Swift).","What we dislike":"Only for macOS.","Twitter":"@devutils_app"},{"Company/Org":"Koj","Tool/Product/Project":"Upptime","Initial review":"2020-12-28","Scheduled for":"2020-12-31","URL":"https://upptime.js.org/","Announced":"","Category":"DevOps","Type":"Open Source","What is it?":"An open source uptime monitor and status page powered by GitHub actions.","What we like":"Nicely designed status pages. Monitoring triggered every 5 minutes using GitHub actions - can stay within the free quota. Different notification types supported. Good integration with GitHub issues.","What we dislike":"Relies on GitHub. 5 minute check granularity. Is this an abuse of the GitHub Actions service, which isn't designed to run mission-critical monitoring.","Twitter":"@AnandChowdhary"},{"Company/Org":"","Tool/Product/Project":"edamagit","Initial review":"2020-12-28","Scheduled for":"","URL":"https://github.com/kahole/edamagit","Announced":"","Category":"Developer Tools","Type":"Open Source","What is it?":"Keyboard driven Git interface for VS Code","What we like":"Text-based and keyboard focused makes managing Git repos really fast inside VS Code.","What we dislike":"Missing some features from Magit (which it is based on), such as bisect and patch.","Twitter":""},{"Company/Org":"Bytedance","Tool/Product/Project":"TerarkDB","Initial review":"2020-12-23","Scheduled for":"","URL":"https://github.com/bytedance/terarkdb","Announced":"2020-12-16","Category":"Database","Type":"Open Source","What is it?":"RocksDB KV replacement with better performance.","What we like":"Optimised tail performance, throughput, and compression. Easy migration from RocksDB.","What we dislike":"Only C/C++ bindings are fully tested. Can only migrate one way - can't go back to RocksDB. Very limited documentation.","Twitter":""},{"Company/Org":"Hotwire","Tool/Product/Project":"Hotwire","Initial review":"2020-12-23","Scheduled for":"2020-12-24","URL":"https://hotwire.dev/","Announced":"2020-12-22","Category":"Developer Tools","Type":"Open Source","What is it?":"HTML over the wire instead of JSON.","What we like":"Allows web applications to load faster with less client-side processing by rendering HTML server-side. With so much cheap compute in the cloud (or on VMs), why let low-power/battery constrained user devices do all the work? Provides a web framework which can also be used in native iOS and Android apps.","What we dislike":"Reference integration available only for Ruby on Rails, but it can be used with other languages. Yet another framework to use. Some logic goes into HTML syntax.","Twitter":""},{"Company/Org":"SuperTokens","Tool/Product/Project":"SuperTokens Core","Initial review":"2020-12-16","Scheduled for":"","URL":"https://github.com/supertokens/supertokens-core","Announced":"2020-12-15","Category":"Developer Tools","Type":"Open Source","What is it?":"Open source version of Auth0.","What we like":"Modular components make it easy to customise, particularly if you want to run your own credential store rather than offload it to a SaaS vendor like Auth0 and AWS Cognito. Optional session management component. SaaS version is optional. Self-hosted is free forever.","What we dislike":"Written in Java. Doesn't support yet support user management like password reset. Open source models are hard - business model for the company behind it is yet to be proven.","Twitter":""},{"Company/Org":"Crowd Security","Tool/Product/Project":"CrowdSec","Initial review":"2020-12-16","Scheduled for":"2020-12-17","URL":"https://github.com/crowdsecurity/crowdsec","Announced":"2020-11-01","Category":"DevOps","Type":"Open Source","What is it?":"A modern Fail2ban using crowd sourced detection.","What we like":"Follows local log files to build a profile of normal activity. Can take configurable actions e.g. ban IP, on detecting unusual behaviour. Crowdsources definitions of \"unusual\" without sending any log data to the cloud.","What we dislike":"Early release. Open source but built by a startup that is on a route to funding next year.","Twitter":"@Crowd_Security"},{"Company/Org":"Microlink","Tool/Product/Project":"Microlink","Initial review":"2020-12-16","Scheduled for":"2020-12-17","URL":"https://microlink.io/","Announced":"","Category":"API","Type":"SaaS","What is it?":"Browser as an API","What we like":"Simulate a browser accessing a URL to retrieve screenshots, metadata (Open Graph, Twitter, JSON+LD, oEmbed & HTML), convert to PDF, track speed using Lighthouse. Open source so you can run it yourself, or pay for hosted cloud version.","What we dislike":"There is a CLI but the SDKs seem to be JS based for building things like link previews in the browser. More language bindings would be useful.","Twitter":"@microlinkhq"},{"Company/Org":"DevBook","Tool/Product/Project":"DevBook","Initial review":"2020-12-16","Scheduled for":"","URL":"https://usedevbook.com/","Announced":"2020-12-01","Category":"Developer Tools","Type":"SaaS","What is it?":"A search engine made just for developers.","What we like":"Quickly search GitHub and StackOverflow using keyboard shortcuts, like OS X Spotlight or Alfred. Built-in code highlighting.","What we dislike":"macOS only.","Twitter":""},{"Company/Org":"GitHub","Tool/Product/Project":"Dark Mode","Initial review":"2020-12-09","Scheduled for":"2020-12-10","URL":"https://github.com/settings/appearance","Announced":"2020-12-08","Category":"Developer Tools","Type":"SaaS","What is it?":"Official dark mode for GitHub","What we like":"Finally! One of the last remaining developer tools that didn't have dark mode. Can set it to force dark, force light, or use system default.","What we dislike":"Could use some more contrast, but otherwise we really like this!","Twitter":""},{"Company/Org":"Mapbox","Tool/Product/Project":"GL JS","Initial review":"2020-12-09","Scheduled for":"2020-12-10","URL":"https://www.mapbox.com/mapbox-gljs","Announced":"2020-12-08","Category":"API","Type":"N/A","What is it?":"A JS library for vector maps.","What we like":"Renders detailed maps at 60fps. Adds progressive loading for tiles and cusom design elements. New camera API for precise viewing adjustments and the new Sky API simulates the sun's position based on time of day and location.","What we dislike":"Does not support offline usage although tilea are cached for 30 days on client devices. Mapbox is setting the standard for commercial mapping with flexible customisation, but Google still wins in most locations for accuracy and detail. The tradeoff is privacy.","Twitter":""},{"Company/Org":"WakaTime","Tool/Product/Project":"WakaTime","Initial review":"2020-12-09","Scheduled for":"","URL":"https://wakatime.com/","Announced":"","Category":"Developer Tools","Type":"SaaS","What is it?":"A service to track personal for metrics about your programming.","What we like":"See how much time you spend coding, in which languages, and on which projects.","What we dislike":"Massive invasion of privacy. Fun if you keep it private for your own use but dangerous if it is used in a business context. Time spent != quality | productivity.","Twitter":""},{"Company/Org":"Rahul Padalkar","Tool/Product/Project":"Beautiful Codes","Initial review":"2020-12-07","Scheduled for":"","URL":"https://www.beautifulcodes.in/","Announced":"2020-12-03","Category":"Developer Tools","Type":"SaaS","What is it?":"Code screenshot generator.","What we like":"Easy generation of code snippets with customisable colours, fonts, and syntax highlighting.","What we dislike":"Would like to see different image formats, ideally SVG. Maybe code snippets are better in actual text format?","Twitter":""},{"Company/Org":"Microsoft","Tool/Product/Project":"Ethr","Initial review":"2020-12-03","Scheduled for":"2020-12-10","URL":"https://github.com/microsoft/ethr","Announced":"2020-11-24","Category":"DevOps","Type":"Open Source","What is it?":"Cross-platform netrwork performance measurement CLI.","What we like":"It's comprehensive. Includes measurements of bandwidth, connections/s, packets/s, latency, loss, jitter, multi-protocol support and multi-platform support. Written in Go.","What we dislike":"Nothing! This tool just does the job.","Twitter":""},{"Company/Org":"CNCF","Tool/Product/Project":"Kuma 1.0","Initial review":"2020-12-02","Scheduled for":"2020-12-03","URL":"https://github.com/kumahq/kuma","Announced":"2020-12-01","Category":"DevOps","Type":"Open Source","What is it?":"Control plane for Service Mesh and Microservices","What we like":"Makes it easy to build a L4/L7 control plane so you can manage connectivity over (often unreliable) networks. v1.0 adds multi-zone support and out-of-the-box Grafana metrics. Allows you to trace/monitor traffic and manage blue/green, canary, and versioned deploys (+ rollbacks).","What we dislike":"YAML config (some people love YAML, some hate it). Another layer to manage in your infrastructure stack.","Twitter":""},{"Company/Org":"Load Impact","Tool/Product/Project":"k6","Initial review":"2020-12-01","Scheduled for":"2020-12-03","URL":"https://k6.io/","Announced":"","Category":"Developer Tools","Type":"Open Source","What is it?":"A load testing tool designed for local and CI/CD performance testing.","What we like":"Easy to get started with comprehensive documentation, CLI invocation, easy config using JS scripts with advanced support for HTTP2, WebSockets, cookies, .har output, and distributed execution via a commercial SaaS product.","What we dislike":"Doesn't run a browser (by design) so browser-specific APIs are not available.","Twitter":""},{"Company/Org":"mhx","Tool/Product/Project":"DwarFS","Initial review":"2020-11-30","Scheduled for":"2020-12-03","URL":"https://github.com/mhx/dwarfs","Announced":"2020-11-22","Category":"Developer Tools","Type":"Open Source","What is it?":"A high compression read-only file system.","What we like":"Focus on performance: reported to be faster with less CPU usage than other file systems, and an order of magnitude greater compression than SquashFS. Clusters files by similarity based on a hash function.","What we dislike":"Early release - so be careful with your files!","Twitter":""},{"Company/Org":"Thought Machine","Tool/Product/Project":"Please","Initial review":"2020-11-30","Scheduled for":"","URL":"https://please.build/","Announced":"","Category":"Developer Tools","Type":"Open Source","What is it?":"A local code build system, like make, written in Go, and designed for multi-language support.","What we like":"Focus on performance. Native sandboxing. Produces a single executable binary with alll dependencies self-contained e.g. Python creates a .pex file like a .jar file.","What we dislike":"Quick start is a bit more involved e.g. 28 min guide for Python, 30 min guide for Go. Uses a DSL for build files so you have to learn something entirely new. Uses non-standard approaches for some languages e.g. Python outputs a single .pex file and dependencies must be defined in the build file, not requirements.txt. Limited support for remote builds and cross compiling.","Twitter":""},{"Company/Org":"Autocode","Tool/Product/Project":"Autocode","Initial review":"2020-11-25","Scheduled for":"2020-11-26","URL":"https://autocode.com/","Announced":"2020-11-24","Category":"Developer Tools","Type":"SaaS","What is it?":"Automate and integrate services, backed by code.","What we like":"Allows you to integrate APIs, webhooks, and services without running your own servers; like Zapier, but backed by code so it is significantly more flexible. Includes an open source framework and has a standard library of integrations with the likes of Airtable, GMail, GCal, GitHub, Slack, Trello. Use their web IDE or use the cli to bring your own local environment.","What we dislike":"Based around JS and npm (may bean advantage if you're happy working with JS, like everything seems to be these days!). Relies on a hosted service - you can't manage your own infrastructure (by design), so you lose control of things like reliability and security which may be important for some of the data being sent e.g. Stripe payments.","Twitter":""},{"Company/Org":"Lens","Tool/Product/Project":"Lens","Initial review":"2020-11-25","Scheduled for":"2020-11-26","URL":"https://github.com/lensapp/lens","Announced":"2020-11-20","Category":"DevOps","Type":"Open Source","What is it?":"An IDE for managing k8s clusters locally or remote (including EKS, GKE, AKS) on Windows, macOS, or Linux.","What we like":"Easy to use on any desktop platform by pointing to your kubeconfig file. Provides real time stats, log streams and graphical visualisations via Prometheus. Helm Charts support. Multi-cluster support. Open source.","What we dislike":"Powerful for development but it is bad practice to directly connect to production environments.","Twitter":""},{"Company/Org":"Clockwork","Tool/Product/Project":"DevTerm","Initial review":"2020-11-25","Scheduled for":"2020-11-26","URL":"https://www.clockworkpi.com/","Announced":"2020-11-20","Category":"Developer Tools","Type":"Open Source","What is it?":"A portable hardware terminal based on a RaspberryPi with built-in keyboard and display.","What we like":"Small (A5 size), retro design with built-in 5G and lots of ports. Comes disassembled and with a modular design so it's designed to be fun to put together and upgradable. 1280x480 IPS screen. Open source software and hardware.","What we dislike":"Flat display means ergonomics may be a pain. Uses a RaspberryPi so max 4GB memory and an ARM chip which may limit software availability (this is rapidly improving, especially with the new Apple M1 chips). Requires 18650 battery (not included). Not shipping until April 2021","Twitter":""},{"Company/Org":"AWS","Tool/Product/Project":"Network Firewall","Initial review":"2020-11-18","Scheduled for":"2020-11-19","URL":"https://aws.amazon.com/blogs/aws/aws-network-firewall-new-managed-firewall-service-in-vpc/","Announced":"2020-11-17","Category":"Cloud","Type":"SaaS","What is it?":"VPC level high-availability network firewall that offers stateful inspection and filtering at the virtual network level.","What we like":"Works at the network level to interact with all associated services. Integrated logging with AWS Kinesis and Cloudwatch as well as third party services like Datadog, Sumologic and Splunk.","What we dislike":"Limited to US East (N. Virginia), US West (Oregon), and Europe (Ireland) Regions for now. Potentially expensive per GB traffic processing fees.","Twitter":""},{"Company/Org":"EteSync","Tool/Product/Project":"Etebase","Initial review":"2020-11-17","Scheduled for":"2020-11-19","URL":"https://blog.etesync.com/introducing-etebase-an-end-to-end-encrypted-sdk-and-backend/","Announced":"2020-11-16","Category":"Database","Type":"Open Source","What is it?":"End-to-end encrypted Firebase-like database and SDK for applications.","What we like":"Open source end-to-end encryption based on libsodium. SDKs for Python, JS, Java, and C. We like privacy!","What we dislike":"Uncertain funding. Supported by a foundation and the a European Commission program, and this is core component of the EteSync suite, but is it just a side project that will be developed ad-hoc?","Twitter":""},{"Company/Org":"strongDM","Tool/Product/Project":"strongDM","Initial review":"2020-11-17","Scheduled for":"","URL":"https://www.strongdm.com/","Announced":"2020-11-16","Category":"Developer Tools","Type":"SaaS","What is it?":"VPN replacement for tunnelling and SSHing into company resources such as servers, databases and internal tools.","What we like":"Provides a secure way for developers to access resources in production without annoying VPNs, and with history and audit logging for compliance.","What we dislike":"Should developers really be accessing these resources directly?","Twitter":""},{"Company/Org":"Microsoft","Tool/Product/Project":"RAFT","Initial review":"2020-11-19","Scheduled for":"","URL":"https://github.com/microsoft/rest-api-fuzz-testing","Announced":"2020-11-16","Category":"Developer Tools","Type":"Open Source","What is it?":"REST API fuzzing tool for use in CI/CD.","What we like":"Run multiple fuzzers in parallel. Can read the Swagger spec to automatically generate tests.","What we dislike":"It can run anywhere but is designed to run on Azure.","Twitter":""},{"Company/Org":"NSA","Tool/Product/Project":"Ghidra 9.2","Initial review":"2020-11-17","Scheduled for":"","URL":"https://ghidra-sre.org/","Announced":"2020-11-13","Category":"Developer Tools","Type":"Open Source","What is it?":"A set of tools for reverse engineering and anlysing compiled software on Windows, macOS, and Linux.","What we like":"Designed for analysing malicious code but has functionality that allows you to explore how compile apps work without the source code.","What we dislike":"Requires Java. Limited documentation.","Twitter":""},{"Company/Org":"rogchap","Tool/Product/Project":"Wombat","Initial review":"2020-11-19","Scheduled for":"","URL":"https://github.com/rogchap/wombat","Announced":"2020-11-12","Category":"Developer Tools","Type":"Open Source","What is it?":"A cross-platform desktop gRPC client that allows for rapid interaction with APIs.","What we like":"Auto discovery of protocols makes it easy to connect APIs for rapid debugging. Built using Go and a non-Electron web framework wrapper.","What we dislike":"Lacks a true native feel due to the use of web tech inside a wrapper.","Twitter":""},{"Company/Org":"ogham","Tool/Product/Project":"dog 0.1","Initial review":"2020-11-17","Scheduled for":"","URL":"https://dns.lookup.dog/","Announced":"2020-11-07","Category":"DevOps","Type":"Open Source","What is it?":"A command line interface for querying DNS records. Supports DNS over TLS, DNS over HTTPs, and JSON output.","What we like":"Very lightweight, written in Rust, cross platform support, colourful output, and generally a much nicer way to query DNS than dig.","What we dislike":"No official packages for installing (binaries available for all platforms).","Twitter":""},{"Company/Org":"micro","Tool/Product/Project":"Micro 3.0 (M3O)","Initial review":"2020-11-17","Scheduled for":"2020-11-19","URL":"https://micro.mu/blog/2020/11/05/micro-v3-aka-m3o.html","Announced":"2020-11-05","Category":"Developer Tools","Type":"SaaS","What is it?":"An open source framework (micro) that makes it easy to build microservices for cloud environments, especially if you use their paid SaaS platform (M30).","What we like":"Lightweight framework written in Go and Rust which reminds us of Ruby on Rails. Quick creation of key microservices components such as service discovery, auth and API gateway. Can use free, open source, or pay for their cloud service.","What we dislike":"Cloud platform is very early with low resource caps and billed per user rather than on resource usage. Unsure how this sits alongside mature cloud platforms from AWS, GCP or Azure. No production-grade SLAs or monitoring.","Twitter":""},{"Company/Org":"Hasura","Tool/Product/Project":"Hasura GraphQL","Initial review":"2020-11-17","Scheduled for":"","URL":"https://hasura.io/","Announced":"","Category":"Developer Tools","Type":"SaaS","What is it?":"A database connector for PostgreSQL and MySQL that allows you to query them using GraphQL.","What we like":"Easily create a GraphQL API on existing databases, with automatic authentication and caching layers. Available open source and as a cloud service with monitoring, auto-scaling, regression testing and rate limiting.","What we dislike":"This is an additional layer between your frontend and the database, they do not host the database itself. The performance overhead is unknown.","Twitter":""}],"header":["Company/Org","Tool/Product/Project","Initial review","Scheduled for","URL","Announced","Category","Type","What is it?","What we like","What we dislike","Twitter"],"range":"'All Tools'!A1:L1029"}}]}
